@bebold-jhr this issue was automatically closed because of the doc fix for the import instructions being merged. Beyond that, though, I was unable to replicate your issue. Here's my Terraform code:

```hcl 
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "= 4.50.0"
    }
  }
}

provider "aws" {
  region = "eu-west-2"
}

data "aws_region" "current" {}

resource "aws_vpc_ipam" "test" {
  operating_regions {
    region_name = data.aws_region.current.name
  }
}

resource "aws_vpc_ipam_pool" "test" {
  address_family = "ipv4"
  ipam_scope_id  = aws_vpc_ipam.test.private_default_scope_id
  locale         = data.aws_region.current.name
}

resource "aws_vpc_ipam_pool_cidr" "test" {
  ipam_pool_id = aws_vpc_ipam_pool.test.id
  cidr         = "172.2.0.0/24"
}

resource "aws_vpc_ipam_pool_cidr_allocation" "test" {
  ipam_pool_id = aws_vpc_ipam_pool.test.id
  cidr         = cidrsubnet(aws_vpc_ipam_pool_cidr.test.cidr, 4, 0)
}
```

And here's my reproducer script:

```sh
#!/bin/sh

terraform apply -auto-approve
pool_alloc_id=$(terraform state show aws_vpc_ipam_pool_cidr_allocation.test | awk '$3 ~ /ipam-pool-alloc-.*ipam-pool-/ { gsub(/"/, "", $3); print $3 }')
terraform state show aws_vpc_ipam_pool_cidr_allocation.test
terraform state rm aws_vpc_ipam_pool_cidr_allocation.test
terraform import aws_vpc_ipam_pool_cidr_allocation.test ${pool_alloc_id}
terraform plan
```

Here's the output showing that the `state rm`, `import` and subsequent `plan` commands result in no changes. If you're still able to reproduce this then please let us know and we'll take another look. Thanks!

```
$ ./test.sh 
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc_ipam.test will be created
  + resource "aws_vpc_ipam" "test" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + private_default_scope_id = (known after apply)
      + public_default_scope_id  = (known after apply)
      + scope_count              = (known after apply)
      + tags_all                 = (known after apply)

      + operating_regions {
          + region_name = "eu-west-2"
        }
    }

  # aws_vpc_ipam_pool.test will be created
  + resource "aws_vpc_ipam_pool" "test" {
      + address_family  = "ipv4"
      + arn             = (known after apply)
      + auto_import     = false
      + id              = (known after apply)
      + ipam_scope_id   = (known after apply)
      + ipam_scope_type = (known after apply)
      + locale          = "eu-west-2"
      + pool_depth      = (known after apply)
      + state           = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_vpc_ipam_pool_cidr.test will be created
  + resource "aws_vpc_ipam_pool_cidr" "test" {
      + cidr         = "172.2.0.0/24"
      + id           = (known after apply)
      + ipam_pool_id = (known after apply)
    }

  # aws_vpc_ipam_pool_cidr_allocation.test will be created
  + resource "aws_vpc_ipam_pool_cidr_allocation" "test" {
      + cidr                    = "172.2.0.0/28"
      + id                      = (known after apply)
      + ipam_pool_allocation_id = (known after apply)
      + ipam_pool_id            = (known after apply)
      + resource_id             = (known after apply)
      + resource_owner          = (known after apply)
      + resource_type           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_vpc_ipam.test: Creating...
aws_vpc_ipam.test: Creation complete after 6s [id=ipam-073dc05f1f7339027]
aws_vpc_ipam_pool.test: Creating...
aws_vpc_ipam_pool.test: Creation complete after 9s [id=ipam-pool-049638b27f930c431]
aws_vpc_ipam_pool_cidr.test: Creating...
aws_vpc_ipam_pool_cidr.test: Still creating... [10s elapsed]
aws_vpc_ipam_pool_cidr.test: Creation complete after 13s [id=172.2.0.0/24_ipam-pool-049638b27f930c431]
aws_vpc_ipam_pool_cidr_allocation.test: Creating...
aws_vpc_ipam_pool_cidr_allocation.test: Creation complete after 0s [id=ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938_ipam-pool-049638b27f930c431]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
# aws_vpc_ipam_pool_cidr_allocation.test:
resource "aws_vpc_ipam_pool_cidr_allocation" "test" {
    cidr                    = "172.2.0.0/28"
    id                      = "ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938_ipam-pool-049638b27f930c431"
    ipam_pool_allocation_id = "ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938"
    ipam_pool_id            = "ipam-pool-049638b27f930c431"
    resource_owner          = "320797911953"
    resource_type           = "custom"
}
Removed aws_vpc_ipam_pool_cidr_allocation.test
Successfully removed 1 resource instance(s).
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
aws_vpc_ipam_pool_cidr_allocation.test: Importing from ID "ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938_ipam-pool-049638b27f930c431"...
aws_vpc_ipam_pool_cidr_allocation.test: Import prepared!
  Prepared aws_vpc_ipam_pool_cidr_allocation for import
aws_vpc_ipam_pool_cidr_allocation.test: Refreshing state... [id=ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938_ipam-pool-049638b27f930c431]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.

data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
aws_vpc_ipam.test: Refreshing state... [id=ipam-073dc05f1f7339027]
aws_vpc_ipam_pool.test: Refreshing state... [id=ipam-pool-049638b27f930c431]
aws_vpc_ipam_pool_cidr.test: Refreshing state... [id=172.2.0.0/24_ipam-pool-049638b27f930c431]
aws_vpc_ipam_pool_cidr_allocation.test: Refreshing state... [id=ipam-pool-alloc-0272f2f2a1ad642039d3f6c6abfa54938_ipam-pool-049638b27f930c431]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```